Revit 2027 API
SizingOptions.Roughness Property
 The material roughness in ft, defaults to 0.0003 ft.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Roughness { get; set; }
Public Property Roughness As Double
	Get
	Set
public:
property double Roughness {
	double get ();
	void set (double value);
}
member Roughness : float with get, set
Property Value
Double
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace